const content = {
    currentId: 0,
    filter: "",
    consoles: [
        {
            title: "Apple",
            images: [
                "img/Apple.jpg",
                "img/A15.jpg",
                "img/M1.jpg",
            ],
            texts: [
                "Apple — американская корпорация, производитель персональных и планшетных компьютеров, аудиоплееров, смартфонов, программного обеспечения. Одна из самых известных компаний по производству ARM процессоров",
                "Самым последним процессором для телефонов является: Apple A15 Bionic. Он же и самый производительный мобильный процессор в 2021 году",
                "Apple A15 (англ. A15 Bionic chip) — система на кристалле компании Apple из серии Apple Ax, модель осени 2021 года. В состав системы входит 64-битный 6-ядерный ARM-микропроцессор. Разработан Apple и производится контрактным производителем TSMC по усовершенствованному 5-нанометровом (N5P) техпроцессу. Содержит 15 млрд транзисторов.",
                "",
                "Apple M1 — система на кристалле ARM-архитектуры компании Apple из серии Apple Silicon, используемая в компьютерах Mac, ноутбуках MacBook и планшетах iPad Pro.",
                "M1 имеет около 16 миллиардов транзисторов.",
                "M1 Pro располагает 33,7 млрд транзисторов, тогда как M1 Max состоит уже из 57 млрд транзисторов.",
                "На сегодняшний день M1 Max является самым мощным ARM процессором",

            ],
            
        },
        {
            title: "Qualcomm",
            images: [
                "img/Qual.jpg",
                "img/Snep.jpg",
                "img/888.jpg",
                "img/8cx.jpg",
            ],
            texts: [
                "Qualcomm Inc. — компания по разработке и исследованию беспроводных средств связи, а также SoC. Один из самых известных производителей процессоров для смартфонов на андроид",
                "Qualcomm Snapdragon 888 Plus - восьмиядерный чипсет, который был анонсирован 28 июня 2021 года и изготовляется по 5-нанометровому техпроцессу.",
                "Он имеет 1 ядро Kryo 680 Prime (Cortex-X1) на 2995 МГц, 3 ядра Kryo 680 Gold (Cortex-A78) на 2420 МГц и 4 ядра Kryo 680 Silver (Cortex-A55) на 1800 МГц.",
                "",
                "У Qualcomm очень мало ARM процессоров, но они все же есть. Самый последний является Qualcomm Snapdragon 8cx",
                "Qualcomm Snapdragon 8cx - это процессор на архитектуре семейства ARM, ориентированный на планшеты и ноутбуки с Windows. Процессорные ядра в 8cx очень похожи на Snapdragon 855, но без функции Prime Core. Процессор изготавливается на 7-нанометровом производстве компании TSMC",
                
            ]
        },
        {
            title: "Samsung",
            images: [
                "img/sams.jpg",
                "img/2100.jpg",
            ],
            texts: [
                "Samsung Group — южнокорейская группа компаний, основанный в 1938 году. На мировом рынке известен как производитель высокотехнологичных компонентов, включая полноцикловое производство интегральных микросхем, телекоммуникационного оборудования, бытовой техники, аудио- и видеоустройств.",
                "Samsung Exynos 2100 - восьмиядерный чипсет, который был анонсирован 12 декабря 2020 года и изготовляется по 5-нанометровому техпроцессу. Он имеет 1 ядро Cortex-X1 на 2900 МГц, 3 ядра Cortex-A78 на 2800 МГц и 4 ядра Cortex-A55 на 2200 МГц.",
                "На сегодняшний день Exynos 2100 является передовым мобильным процессором компании Samsung",
                "",
                "Samsung не производит процессоров для ноутбуков",
                ]
        },
        {
            title: "MediaTek",
            images: [
                "img/Med.jpg",
                "img/1200.jpg",
            ],
            texts: [
                "MediaTek на ряду с Qualcomm является одним из крупнейших поставщиков чипсетов для смартфонов.",
                "Самым передовым ARM процессором является MediaTek Dimensity 1200",
                "MediaTek Dimensity 1200 - восьмиядерный чипсет, который был анонсирован 19 января 2021 года и изготовляется по 6-нанометровому техпроцессу. Он имеет 1 ядро Cortex-A78 на 3000 МГц, 3 ядра Cortex-A78 на 2600 МГц и 4 ядра Cortex-A55 на 2000 МГц.",
                "",
                "MediaTek не производит процессоров для ноутбуков",
            ]
        }
    ]
};