const content = {
    currentId: 0,
    filter: "",
    consoles: [
        {
            title: "AMD",
            images: [
                "img/amd.jpg",
                "img/r5.jpg",
                "img/r7.jpg",
                "img/r9.jpg",
            ],
            texts: [
                "AMD известна многим людям своими производительными процессорами и недавно вышла 5000 серия процессоров ryzen, о которых вы можете узнать здесь. Все процессоры 5к серии используют новую архетектуру zen3.",
                "Процессоры AMD Ryzen™ 5000 серии для настольных ПК:",
                "",
                "AMD Ryzen 5 5600X",
                "Бюджетное и производительное решение от AMD. Построенный на привычной для AMD техпроцессе в 7 нм. Так же, как и все придыдущие r5 имеет 6 ядер и 12 потоков. И имеет максимальную частоту до 4.6GHz	с базовой в 3.7GHz и имеет TDP 65 ватт ",
                "",
                "AMD Ryzen 7 5800X",
                "Среднебюджетный процессор. Построенный на привычной для AMD техпроцессе в 7 нм. Так же, как и все придыдущие r7 имеет 8 ядер и 16 потоков. И имеет максимальную частоту до 4.7GHz	с базовой в 3.8GHz и имеет TDP 105 ватт",
                "",
                "AMD Ryzen 9 5900X",
                "Одно из двух профессиональных решений от AMD. Построенный на привычной для AMD техпроцессе в 7 нм. Имеет 12 ядер и 24 потоков. И имеет максимальную частоту до 4.8GHz с базовой в 3.7GHz и имеет TDP 105 ватт",
                "",
                "AMD Ryzen 9 5950X",
                "Второй профессиональный процессор от AMD. Построенный на привычной для AMD техпроцессе в 7 нм. Имеет 16 ядер и 36 потоков. И имеет максимальную частоту до 4.9GHz с базовой в 3.4GHz и имеет TDP 105 ватт",
            ]
        },
        {
            title: "Intel",
            images: [
                "img/intel.jpg",
                "img/i5.jpg",
                "img/i7.jpg",
                "img/i9.jpg",
            ],
            texts: [
                "Intel вторая самая популярная компания в мире с очень популярными и мощными процессорами",
                "Alder Lake — кодовое имя семейства процессоров фирмы Intel 12-го поколения. Имеет сокет LGA 1700. Все процессоры 12 поколения поддерживают до 128 Гбайт оперативной памяти DDR4 или DDR5 в двухканальном режиме",
                "",
                "Intel Core i5 12600K",
                "Бюджетный процессор от Intel. Имеет всего 10 ядер, 6 из них высокопроизводительные, а 4 энергоэффективных и имеет 16 потоков. Высокопроизводительные ядра имеют базовую частоту 3,70GHz(в режиме Turbo 4,90 GHz), а энергоэффективные 2.80 GHz(в режиме Turbo 3,70 GHz)",
                "",
                "Intel Core i7-12700K",
                "Среднебюджетный процессор от Intel. Имеет всего 12 ядер, 8 из них высокопроизводительные, а 4 энергоэффективных и имеет 20 потоков. Высокопроизводительные ядра имеют базовую частоту 3,60GHz(в режиме Turbo 5,00 GHz), а энергоэффективные 2.70 GHz(в режиме Turbo 3,80 GHz)",
                "",
                "Intel Core i9 12900K",
                "Профессиональный процессор от Intel. Имеет всего 16 ядер, 8 из них высокопроизводительные, а 8 энергоэффективных и имеет 24 потока. Высокопроизводительные ядра имеют базовую частоту 3,20GHz(в режиме Turbo 5,20 GHz), а энергоэффективные 2.40 GHz(в режиме Turbo 3,90 GHz)",
            ]
        },
        {
            title: "Эльбрус",
            images: [
                "img/Elb.jpg"
            ],
            texts: [
                "Эльбрус-8С и Эльбрус-8СВ — 8-ядерные процессоры с архитектурой «Эльбрус» для персональных компьютеров и серверов. Разработаны и выпускаются российской компанией МЦСТ",
                "Кристалл микропроцессора спроектирован по технологии 28 нм, имеет 8 процессорных ядер с улучшенной 64-разрядной архитектурой «Эльбрус» 3-го поколения, кэш-память 2-го уровня общим объёмом 4 мегабайта и 3-го уровня объёмом 16 мегабайт.",
            ]
        },
        
    ]
}