const content = {
    currentId: 0,
    filter: "",

    consoles: [
        {
            title: "AMD",
            images: [
                "img/rad.jpg"
            ],
            texts: [
                "AMD Radeon RX 6000 series",
                "RX 6000 серии на базе революционной архитектуры AMD RDNA™ 2, которые обеспечивают невероятную производительность и потрясающее изображение в играх.",
                "Игры для ПК каждый раз заставляют производителей компьютерного оборудования совершать невозможное в погоне за более четким изображением и более высокой частотой кадров. С видеокартами Radeon RX 6800, 6800 XT и 6900 XT, оснащенными памятью объемом 16 ГБ, вы сможете играть в любые игры с разрешением 4K и максимальными настройками.",
            ]
        },
        {
            title: "Nvidia",
            images: [
                "img/Nv.jpg"
            ],
            texts: [
                "Видеокарты GeForce RTX 30 на базе архитектуры Ampere обеспечивают исключительную производительность в играх, стриминге и при обработке графики и видео. Ampere — это новая архитектура NVIDIA RTX второго поколения с новыми ядрами RT, тензорными ядрами и потоковыми мультипроцессорами, обеспечивающими максимально реалистичные эффекты трассировки лучей и передовые возможности на базе искусственного интеллекта.",
                "NVIDIA RTX является самой продвинутой платформой для работы технологий трассировки лучей и искусственного интеллекта, которые преображают и улучшают игровой процесс и работу приложений для создания контента.",
                "Выведите работу с графикой на новый уровень с видеокартами GeForce RTX. Ускорение популярных графических приложений и новые возможности с использованием ИИ благодаря платформе NVIDIA Studio.",
            ]
        },
    ]
}