const content = {
    currentId: 0,
    filter: "",
    consoles: [
        {
            title: "AMD EPYC",
            images: [
                "img/ep.jpg",
                "img/ep1.jpg",
            ],
            texts: [
                "Процессор AMD EPYC обеспечивает быстрые и защищенные ИТ-операции с высокой скоростью реагирования для развертывания любых вычислительных систем — без предустановленной ОС, виртуализированных или облачных.",
                "AMD EPYC™ 3-го поколения — это самые быстрые в мире серверные процессоры на базе архитектуры x86.",
                "Процессоры AMD EPYC™ снабжены расширенными функциями безопасности, помогающими снизить риски.",
                "1) Технология защищенной шифрованной виртуализации (SEV, Secure Encrypted Virtualization) помогает защитить конфиденциальность и целостность виртуальных машин.",
                "2) Защитная технология SEV-SNP (Secure Nested Paging) обеспечивает надежную защиту целостности памяти",
                "3) Технология защитного шифрования памяти (SME, Secure Memory Encryption) помогает обеспечить защиту от атак на основную память",
                "4) Функция AMD Shadow  для аппаратной защиты стека от атак вредоносного ПО",
            ]
        },
        {
            title: "Intel Xeon",
            images: [
                "img/xe.jpg",
            ],
            texts: [
                "Масштабируемые процессоры Intel Xeon 3-го поколения со сбалансированной архитектурой, обеспечивающей встроенные функции ускорения искусственного интеллекта и улучшенные функции безопасности, что позволяет безопасно выполнять рабочие нагрузки там, где они наиболее эффективны, от периферии до облака.",
                "Масштабируемые процессоры Intel Xeon 3-го поколения созданы на основе многих лет инноваций для удовлетворения требований, предъявляемых к самым распространенным рабочим нагрузкам. Они поддерживаются нашими близкими партнерами и глубоко интегрируются с продукцией ведущих мировых компаний и поставщиков решений в сфере программного обеспечения. Масштабируемые процессоры Intel Xeon 3-го поколения оптимизированы для многих типов рабочих нагрузок и уровней производительности и созданы на базе согласованной, открытой и проверенной временем архитектуры Intel.",
                "",    
                "Процессор Intel Xeon E",  
                "Необходимый корпоративный уровень производительности, масштабируемости и надежности для серверов начального уровня.",  
                "",  
                "Процессор Intel Xeon W", 
                "Предназначен для профессиональных создателей контента, обеспечивает производительность, необходимую для VFX, 3D-рендеринга и САПР для 3D-проектирования на рабочей станции.",  
                "",  
                "Процессор Intel Xeon D",  
                "Оптимизированная для рабочих задач производительность в условиях ограниченного пространства и времени, от ЦОД до интеллектуальной периферии.",   
            ]
        },
        
    ]
}